<?php

/**
* 商家公用配置
*
* @category yunke
* @package atlas\hell\spider-man\src\config
* @author no<no>
* @copyright © no. All rights reserved.
*/
return array(
	// 分页设置
    'page' => 10,
    'modal' => array(
        'graphics' => 4,
        'material' => 4,
        'image' => 12,
        'voice' => 4,
        'video' => 4,
        'store' => 4
    ),

    // 导入行数限制
    'rows' => 1000,

    // 店铺设置
    'store' => array(
        // 上传总目录
        'file' => 'hydra',
        //用户微信下载目录
        'usermedia' => array(
            'wechat_url' =>'download/wechat',
            'dir' => 'smaug',
        ),
        // 店铺文件目录
        'path' => array(
            'head' => array(
                'url' => 'head/angel', // 目录
                'size' => 2048, // 2MB
                'mime' => array( // 后缀
                    'bmp' => 'bmp',
                    'png' => 'png',
                    'jpeg' => 'jpeg',
                    'jpg' => 'jpg',
                    'gif' => 'gif'
                )
            ),

            'image' => array(
                'url' => 'store/image', // 目录
                'size' => 2048, // 2MB
                'mime' => array( // 后缀
                    'bmp' => 'bmp',
                    'png' => 'png',
                    'jpeg' => 'jpeg',
                    'jpg' => 'jpg',
                    'gif' => 'gif'
                )
            ),
            
            'voice' => array(
                'url' => 'store/voice', // 目录
                'size' => 5120, // 5MB
                'mime' => array( // 后缀
                    'mp3' => 'mp3',
                    'wma' => 'wma',
                    'wav' => 'wav',
                    'amr' => 'amr'
                )
            ),

            'video' => array(
                'url' => 'store/video', // 目录
                'size' => 10240, // 10MB
                'mime' => array( // 后缀
                    'mp4' => 'mp4'
                )
            )
        ),

        // 微信文件目录
        'wechat' => array(

        ),

        // 服务窗文件目录
        'alipay' => array(

        )
    ),

    // 商家主营类目
    'business' => array(
        '0' => '食品',
        '1' => '美妆',
        '2' => '数码家电',
        '3' => '运动户外',
        '4' => '服饰鞋帽',
        '5' => '箱包配饰',
        '6' => '餐饮外卖',
        '7' => '酒店客栈',
        '8' => '礼品鲜花',
        '9' => '婚庆摄影',
        '10' => '日用百货',
        '11' => '福彩票务'
    ),

    // 门店主营类目
    'category' => array(
        'main' => array(
            0 => '美食',
            1 => '基础设施',
            2 => '医疗保健',
            3 => '生活服务',
            4 => '休闲娱乐',
            5 => '购物',
            6 => '运动健身',
            7 => '汽车',
            8 => '酒店宾馆',
            9 => '旅游景点',
            10 => '文化场馆',
            11 => '教育学校',
            12 => '银行金融',
            13 => '地名地址',
            14 => '房产小区',
            15 => '丽人',
            16 => '结婚',
            17 => '亲子',
            18 => '公司企业',
            19 => '机构团体'
        ),

        'sub' => array(
            0 => array(
                0 => '江浙菜',
                1 => '粤菜',
                2 => '川菜',
                3 => '湘菜',
                4 => '东北菜',
                5 => '徽菜',
                6 => '闽菜',
                7 => '鲁菜',
                8 => '台湾菜',
                9 => '西北菜',
                10 => '东南亚菜',
                11 => '西餐',
                12 => '日韩菜',
                13 => '火锅',
                14 => '清真菜',
                15 => '小吃快餐',
                16 => '海鲜',
                17 => '烧烤',
                18 => '自助餐',
                19 => '面包甜点',
                20 => '茶餐厅',
                21 => '其它美食'
            ),

            1 => array(
                0 => '交通设施',
                1 => '公共设施',
                2 => '道路附属',
                3 => '其它基础设施'
            ),

            2 => array(
                0 => '专科医院',
                1 => '综合医院',
                2 => '诊所',
                3 => '急救中心',
                4 => '药房药店',
                5 => '疾病预防',
                6 => '其它医疗保健'
            ),

            3 => array(
                0 => '家政',
                1 => '宠物服务',
                2 => '旅行社',
                3 => '摄影冲印',
                4 => '洗衣店',
                5 => '票务代售',
                6 => '邮局速递',
                7 => '通讯服务',
                8 => '彩票',
                9 => '报刊亭',
                10 => '自来水营业厅',
                11 => '电力营业厅',
                12 => '教练',
                13 => '生活服务场所',
                14 => '信息咨询中心',
                15 => '招聘求职',
                16 => '中介机构',
                17 => '事务所',
                18 => '丧葬',
                19 => '废品收购站',
                20 => '福利院养老院',
                21 => '测字风水',
                21 => '其它生活服务'
            ),

            4 => array(
                0 => '洗浴推拿足疗',
                1 => 'KTV',
                2 => '酒吧',
                3 => '咖啡厅',
                4 => '茶馆',
                5 => '电影院',
                6 => '棋牌游戏',
                7 => '夜总会',
                8 => '剧场音乐厅',
                9 => '度假疗养',
                10 => '户外活动',
                11 => '网吧',
                12 => '迪厅',
                13 => '演出票务',
                14 => '其它娱乐休闲'
            ),

            5 => array(
                0 => '综合商场',
                1 => '便利店',
                2 => '超市',
                3 => '花鸟鱼虫',
                4 => '家具家居建材',
                5 => '体育户外',
                6 => '服饰鞋包',
                7 => '图书音像',
                8 => '眼镜店',
                9 => '母婴儿童',
                10 => '珠宝饰品',
                11 => '化妆品',
                12 => '食品烟酒',
                13 => '数码家电',
                14 => '农贸市场',
                15 => '小商品市场',
                16 => '旧货市场',
                17 => '商业步行街',
                18 => '礼品',
                19 => '摄影器材',
                20 => '钟表店',
                21 => '拍卖典当行',
                22 => '古玩字画',
                23 => '自行车专卖',
                24 => '文化用品',
                25 => '药店',
                26 => '品牌折扣店',
                27 => '其它购物'
            ),

            6 => array(
                0 => '健身中心',
                1 => '游泳馆',
                2 => '瑜伽',
                3 => '羽毛球馆',
                4 => '乒乓球馆',
                5 => '篮球场',
                6 => '足球场',
                7 => '壁球场',
                8 => '马场',
                9 => '高尔夫场',
                10 => '保龄球馆',
                11 => '溜冰',
                12 => '跆拳道',
                13 => '海滨浴场',
                14 => '网球场',
                15 => '橄榄球',
                16 => '台球馆',
                17 => '滑雪',
                18 => '舞蹈',
                19 => '攀岩馆',
                20 => '射箭馆',
                21 => '综合体育场馆',
                22 => '其它运动健身'
            ),

            7 => array(
                0 => '加油站',
                1 => '停车场',
                2 => '4S店',
                3 => '汽车维修',
                4 => '驾校',
                5 => '汽车租赁',
                6 => '汽车配件销售',
                7 => '汽车保险',
                8 => '摩托车',
                9 => '汽车养护',
                10 => '洗车场',
                11 => '汽车俱乐部',
                12 => '汽车救援',
                13 => '二手车交易市场',
                14 => '车辆管理机构',
                15 => '其它汽车'
            ),

            8 => array(
                0 => '星级酒店',
                1 => '经济型酒店',
                2 => '公寓式酒店',
                3 => '度假村',
                4 => '农家院',
                5 => '青年旅社',
                6 => '旅馆招待所',
                7 => '其它酒店宾馆'
            ),

            9 => array(
                0 => '公园',
                1 => '风景名胜',
                2 => '植物园',
                3 => '动物园',
                4 => '水族馆',
                5 => '城市广场',
                6 => '世界遗产',
                7 => '国家级景点',
                8 => '省级景点',
                9 => '纪念馆',
                10 => '寺庙道观',
                11 => '教堂',
                12 => '海滩',
                13 => '其它旅游景点'
            ),

            10 => array(
                0 => '博物馆',
                1 => '图书馆',
                2 => '美术馆',
                3 => '展览馆',
                4 => '科技馆',
                5 => '天文馆',
                6 => '档案馆',
                7 => '文化宫',
                8 => '会展中心',
                9 => '其它文化场馆'
            ),

            11 => array(
                0 => '小学',
                1 => '幼儿园',
                2 => '培训',
                3 => '大学',
                4 => '中学',
                5 => '职业技术学校',
                6 => '成人教育',
                7 => '其它教育学校'
            ),

            12 => array(
                0 => '银行',
                1 => '自动提款机',
                2 => '保险公司',
                3 => '证券公司',
                4 => '财务公司',
                5 => '其它银行金融'
            ),

            13 => array(
                0 => '交通地名',
                1 => '地名地址信息',
                2 => '道路名',
                3 => '自然地名',
                4 => '行政地名',
                5 => '门牌信息',
                6 => '其它地名地址'
            ),

            14 => array(
                0 => '住宅区',
                1 => '产业园区',
                2 => '商务楼宇',
                3 => '其它房产小区'
            ),

            15 => array(
                0 => '美发',
                1 => '美容',
                2 => 'SPA',
                3 => '瘦身纤体',
                4 => '美甲',
                5 => '写真'
            ),

            16 => array(
                0 => '婚纱摄影',
                1 => '婚宴',
                2 => '婚戒首饰',
                3 => '婚纱礼服',
                4 => '婚庆公司',
                5 => '彩妆造型',
                6 => '司仪主持',
                7 => '婚礼跟拍',
                8 => '婚车租赁',
                9 => '婚礼小商品',
                10 => '婚房装修'
            ),

            17 => array(
                0 => '亲子摄影',
                1 => '亲子游乐',
                2 => '亲子购物',
                3 => '孕产护理'
            ),

            18 => array(
                0 => '企业/工厂',
                1 => '农林牧渔基地',
                2 => '其它公司企业'
            ),

            19 => array(
                0 => '公检法机构',
                1 => '外国机构',
                2 => '工商税务机构',
                3 => '政府机关',
                4 => '民主党派',
                5 => '社会团体',
                6 => '传媒机构',
                7 => '文艺团体',
                8 => '科研机构',
                9 => '其它机构团体'
            )
        ),
    ),
    
    // 套餐设定 0表示没有，99表示无限  其它数字表示实际数字
    'price'=>array(
        'free'=>array(
            'name'=>'免费版',
            'weixin'=>true,
            'space'=>2097152,//kb
            'sms'=>0,
            'template'=>0,
            'yao_page'=>0,
            'price'=>'0'
        ),
        'ent'=>array(
            'name'=>'企业版',
            'weixin'=>true,
            'space'=>5242880,//kb
            'sms'=>2000,
            'template'=>5,
            'yao_page'=>10,
            'price'=>299
        ),
        'pro'=>array(
            'name'=>'旗舰版',
            'weixin'=>true,
            'space'=>10485760,//kb
            'sms'=>5000,
            'template'=>99,
            'yao_page'=>99,
            'price'=>999
        ),
        'exp'=>array(
            'name'=>'定制版',
            'weixin'=>true,
            'space'=>99,//kb
            'sms'=>10000,
            'template'=>5,
            'price'=>0
        )
    ),
    'order_setting'=>array(
        'status'=>array(
            'ready'=>'未支付',
            'paid'=>'已支付',
            'send'=>'已发货',
            'finish'=>'已完成',
            'cancel'=>'已作废',
            'sendback'=>'已退货',
            'refund'=>'已退款'
        ),
    ),
    
);
