@extends('site.layouts.helpdefault')

@section('main')


<div id="main">
  <div class="container">
      <section id="help_wrapper">
          @include('site.helpheader')
          
          <div class="span10 help_content">
              <h3>云客注册协议</h3>
              
              <h4>1. 关于</h4>
              <p>此条款在必要时将进行修订，且毋须另行通知。修订后的条款一旦在网页上公布即有效代替原来的服务条款。</p>

              <h4>2. 账户</h4>
              <p>您同意并理解您有责任将您与用于获得服务的任何帐户相关的密码保密。您负责对您账户下发生的所有的行为和内容负责。</p>

              <h4>3. 付款</h4>
              <p>您注册本服务或其中某服务，即表示您同意支付其中的所有费用。</p>
<p>一点云客可能要求您提供经我们认可的发卡机构发行的信用卡卡号来激活您的服务，和/或支付服务的任何相关费用。一点将从您提供的帐户或信用卡帐户中收取使用费及其他费用。如果授权一点云客通过信用卡收取您的账户相关费用，即表示您授权一点云客自动从该卡持续扣除账户相关的所有费用。
              </p>
              <p>除非因为一点云客的问题导致本服务无法正常提供，您支付的有关本服务的所有费用均不能退款。</p>
              <h4>4. 内容和版权</h4>
              <p>一点云客对您在本服务提交的内容没有所有权，这些内容的所有权仍然归您所有。但是，如果您将页面设置为公开，就意味着您允许其他人查看和共享您的内容。</p>
              <p>您明白一点云客对他人提供的任何内容不在任何方面负责或负有责任，一点云客没有义务预先审查此类内容。但是，一点云客有权随时决定内容是否合适和与本条款相符；如果发现此类内容违反本条款或在其他方面令人反感，美洽可随时并有绝对酌情权预先审查、转移、拒绝、修改和/或删除内容，而不需事先通知。</p>
              <p>本服务的外观设计与专利归一点云客所有。未经一点云客书面许可，您不能复制、拷贝，或者重用任何部分代码和外观设计。</p>

              <h4>5. 隐私政策</h4>

              <p>使用本服务，即表示您同意一点云客合法收集和使用有关您及您所使用本服务的技术性或诊断性信息。收集到的些信息将用于改进网页的内容，提升我们的服务品质。</p>

              <p>一点云客不会将您的信息和内容分享或出售给其他的组织。但以下情况除外：</p>

              <p>您同意让第三方共享资料；</p>
              <p>需要听从法庭传票、法律命令或遵循法律程序；</p>
              <p>您违反了本条款。</p>
              
              <h4>6. 终止</h4>

              <p>您可随时终止您的帐户和/或停用本服务。您在服务终止前支付的任何费用均不能退还（除本服务条款另有明文允许者除外）。</p>

              <p>一点云客可在特定情况下，不需事先通知，可终止或暂停你所使用的账户和服务。此情况的原因包括但不限于：</p>

              <p>违反本服务条款；</p>
              <p>您要求取消或终止您的帐户；</p>
              <p>需要听从法庭传票、法律命令或遵循法律程序；</p>
              <p>突发的自然灾害导致的问题；</p>
              <p>战争、军事行动、暴动或武装叛乱；</p>
              <p>您没有支付与本服务相关的费用；</p>
              <p>一旦您的帐户被终止，阁下将无法正常使用本服务。此外，您可以选择删除您账户下的所有信息和内容。</p>

              <p style="text-align:right;">©一点云客 保留所有权利</p>
          </div>
      </section>
  </div>

</div>
@stop
