<?php

/**
 * 第三方api支付包服务窗接口匹配
*
* @category yunke
* @package app\config\wormhole
* @author no<no>
* @copyright © no. All rights reserved.
*/
return array(
    
    // 支付宝服务窗口
    'url' => array(
    	// 接口编码
	    'charset' => "GBK",
	    // 接口版本
	    'version' => "1.0",
	    // 开放接口地址
	    'openapi' => "https://openapi.alipay.com/gateway.do",
    	// 消息验证
    	'getCheck' => 'alipay.service.check',
    	// 接收消息
    	'getMessage' => 'alipay.mobile.public.message.notify',
    	// 异步单发消息(客服接口)
    	'customSendMessage' => 'alipay.mobile.public.message.custom.send',
    	// 群发消息
    	'totalSendMessage' => 'alipay.mobile.public.message.total.send',
    	// 获取关注者列表
    	'getUserFollowList' => 'alipay.mobile.public.follow.list',
    	// 获取用户地理位置
    	'getUserGis' => 'alipay.mobile.public.gis.get',
    	// 网页授权获取用户基本信息：授权码auth_code
    	'getAuthCode' => 'https://openauth.alipay.com/oauth2/publicAppAuthorize.htm',
    	// 网页授权获取用户基本信息：使用auth_code换取用户OpenId
    	'getOauthToken' => 'alipay.system.oauth.token',
    	// 网页授权获取用户基本信息：获取用户基本信息
    	'getUserInfo' => 'alipay.user.userinfo.share',
    	// 创建菜单
    	'addMenu' => 'alipay.mobile.public.menu.add',
    	// 更新菜单
    	'updateMenu' => 'alipay.mobile.public.menu.update',
    	// 查询菜单
    	'getMenu' => 'alipay.mobile.public.menu.get',
    	// 带参推广二维码
    	'createQrcode' => 'alipay.mobile.public.qrcode.create',
    	// 带参推广短链接
    	'createShortLink' => 'alipay.mobile.public.shortlink.create'
    ),

	// 错误返回日志
	'errcode' => array(
		// 云客服务窗日志定义 - begin
        '-2' => '缺少接口所需参数，无法和服务窗通信',
        
        // 云客服务窗日志定义 - end

		'401' => '服务窗不存在',
		'403' => '服务不可用',
		'503' => '系统错误',
		'813' => 'AppId为空',
		'828' => '短链生成失败',
		'829' => 'sceneId为空',
		'831' => '不合法的sceneId',
		'1001' => '无效的业务参数',
		'1002' => '无效的业务行为',
		'1003' => '解析XML/JSON出错',
		'2001' => '服务窗账号信息不存在',
		'2002' => '服务窗账号暂不能提供服务',
		'2003' => '支付宝账号信息不存在',
		'2004' => '无效的用户userId',
		'2005' => '无效的手机号mobileNo',
		'2006' => '无效的身份证号码identityCard',
		'10001'	=> '绑定账户解析格式错误',
		'10002'	=> '关注者fromUserId不能为空',
		'10003'	=> 'agreementId不能为空',
		'10004'	=> '绑定账户不能为空',
		'10005'	=> 'displayName为空',
		'10006'	=> 'displayName超出长度',
		'10007'	=> 'realName超出长度',
		'10008' => '协议号已被占用',
		'10009'	=> '协议号无效',
		'10010'	=> '协议号已被废弃',
		'10011'	=> '添加外部户业务中的服务窗帐号与消息头服务窗帐号不一致',
		'10012'	=> '重复添加账户',
		'10013'	=> '您添加的账户已达上限',
		'10014'	=> '添加绑定账户失败',
		'10015'	=> '移除绑定账户失败',
		'10016'	=> '禁止移除其它服务窗帐号的绑定账户',
		'10017'	=> '禁止移除其它支付宝用户的绑定账户',
		'10018'	=> '新绑定的户号与要删除的老绑定账户的户号一样,不能换绑',
		'10019'	=> '移除外部户时参数信息不够:agreementId为空时，bindAccountNo和fromUserId均不能为空',
		'10020'	=> '根据bindAccountNo、fromUserId和appId查不到对应的外部账号',
		'10021'	=> '禁止查询非关注用户的绑定账户列表',
		'10022'	=> '请求的支付宝用户Id无效',
		'11001'	=> '菜单解析格式错误',
		'11002'	=> '菜单没有内容',
		'11003'	=> '一级菜单标题超出长度',
		'11004'	=> '二级菜单标题超出长度',
		'11005'	=> '一级菜单超出个数',
		'11006'	=> '二级菜单超出个数',
		'11007'	=> '菜单标题为空',
		'11008'	=> '菜单超出2级',
		'11009'	=> '菜单标题为空',
		'11010'	=> '菜单type不在支持范围内',
		'11011'	=> '无效的关注关系',
		'11012'	=> '推送消息失败',
		'11013'	=> '菜单已经创建过',
		'11014'	=> '菜单actionParam不能为空',
		'11015'	=> '菜单authType非法',
		'11016'	=> '菜单中含有未授权的菜单类型',
		'11017'	=> '菜单中含有非法字符或链接,请检查',
		'12001'	=> '服务窗帐号与消息体内不一致',
		'12002'	=> '消息中含有非法字符或者链接，请检查',
		'12003'	=> '服务窗帐号已经下线,发送消息失败',
		'12004'	=> '批量发送消息频率超限',
		'12005'	=> '使用了已经发送过的分组ID标识',
		'12006'	=> '单发消息频率超限',
		'12007'	=> '没有关注者，发送消息失败',
		'12008'	=> '绑定账户不存在',
		'12020'	=> '消息模板不存在',
		'12021'	=> '消息模板未启用',
		'12022'	=> '无效的消息模板标识templateId',
		'12023'	=> '无效的消息模板内容template',
		'12024'	=> '无效的消息模板KEY，和预设变量KEY冲突',
		'12025'	=> '无效的匹配器matcher',
		'12026'	=> '模板上下文context缺少相关的变量KEY',
		'12030'	=> '用户拒绝接受该服务窗消息',
		'12031'	=> '用户没有行为，发送消息失败',
		'12035'	=> '消息类型非法',
		'13001'	=> '查询用户地理位置信息失败',
		'13002'	=> '服务窗帐号没有查询用户地理位置信息的权限',
		'13003'	=> '禁止查询非关注用户的地理位置信息',
		'13004'	=> '用户地理位置信息不存在',
		'14001'	=> '无效的userId',
		'14002'	=> '系统繁忙,请稍候再次获取',
		'14004'	=> '添加关注失败',
		'14005'	=> '没有添加关注的权限',
		'40001' => '可能遇到的错误: 缺少方法名参数,缺少签名参数,缺少签名类型参数,缺少签名配置(未提供公钥),缺少AppID参数,缺少时间戳参数',
		'40002' => '可能遇到的错误: 不存在的方法名,无效数据格式,无效签名,无效签名类型,无效的AppID参数,非法的时间戳参数,字符集错误',
		'40003'	=> '应用状态不满足条件',
		'20001'	=> '可能遇到的错误: 无效的访问令牌,访问令牌已过期',
		'20000'	=> '系统繁忙'
	)
);
